/**/
"Cancel" = "取消";
/**/
"Delete" = "删除";
/**/
"Open" = "打开";
/**/
"Edit" = "编辑";
/**/
"Yes" = "是";
/**/
"Finish" = "完成";
/**/
"Done" = "完成";
/**/
"Save" = "保存";
/**/
"Undo" = "撤消";
/**/
"Redo" = "恢复";


/*Geometry Edit Action Name*/
"Apply Geometry" = "应用几何";
/*Geometry Edit Action Name*/
"Clear Geometry" = "清除几何";
/*Geometry Edit Action Name*/
"Delete Vertex" = "删除折点";
/*Geometry Edit Action Name*/
"Insert Part" = "插入部件";
/*Geometry Edit Action Name*/
"Insert Vertex" = "插入折点";
/*Geometry Edit Action Name*/
"Move Vertex" = "移动折点";
/*Geometry Edit Action Name*/
"Remove Part" = "移除部件";

/*Collecting attachments*/
"Add" = "添加";
/*Collecting attachments*/
"Take Photo or Video" = "拍摄照片或视频";
/*Collecting attachments*/
"Choose From Library" = "从库中选择";
/*Collecting attachments*/
"Photo" = "照片";
/*Collecting attachments*/
"Video" = "视频";
/*Collecting attachments*/
"Save To Photo Library" = "保存到照片库";
/*Collecting attachments*/
"Download" = "下载";

/*Date attribute*/
"Today" = "今天";

/**/
"Attachments" = "附件";
"Attributes" = "属性";

/**/
"Open in Safari" = "在 Safari 中打开";

/* Please enter a numeric value between 0 and 5.*/
"Enter a number between %i and %i." = "输入一个介于 %i 和 %i 之间的数字。";

/* Please enter a numeric value between 0.5 and 5.0.*/
"Enter a number between %@ and %@." = "输入介于 %@ 和 %@ 之间的数字。";

/* string length error, when user enters too many characters in string attribute editor:
  Too many characters.  Current: 512.  Allowed: 256 */
"Too many characters (%@)" = "字符过多(%@)";

/* When a number is entered outside the range */
"Number is outside the acceptable range." = "数值超出允许范围。";

/* BLOB, RASTER, etc */
"Field type not supported" = "不支持的字段类型";

/**/
"%d of %d" = "%d/%d";

/**/
"Changing Feature Type" = "更改要素类型";
"You are changing the feature type, which may potentially overwrite some field values. Are you sure you want to do this?" =  "你将要更改要素类型，这可能会覆盖某些字段值。是否确实要执行此操作？";

/**/
"Data for pie chart is invalid" = "饼图的数据无效";
"No data to create a pie chart" = "没有用于创建饼图的数据";

/**/
"Created by %@ seconds ago" = "在几秒钟前由 %@ 创建";

/**/
"Created by %@ a minute ago" = "在一分钟前由 %@ 创建";

/**/
"Edited by %@ seconds ago" = "在几秒钟前由 %@ 编辑";

/**/
"Edited by %@ a minute ago" = "在一分钟前由 %@ 编辑";

/**/
"Created seconds ago" = "在几秒钟前创建";

/**/
"Created a minute ago" = "在一分钟前创建";

/**/
"Edited seconds ago" = "在几秒钟前编辑";

/**/
"Edited a minute ago" = "在一分钟前编辑";

/**/
"Created by %@ %d minutes ago" = "在 %d 分钟前由 %@ 创建";

/**/
"Created by %@ an hour ago" = "在一小时前由 %@ 创建";

/**/
"Created by %@ %d hours ago" = "在 %d 小时前由 %@ 创建";

/*"Created by %@ on ${weekDay} at ${formattedTime}"*/
"Created by %@ on %@ at %@ - day" = "由 %@ 在 %@ %@ 时创建";

/*"Created by %@ on ${formattedDate} at ${formattedTime}"*/
"Created by %@ on %@ at %@ - full" = "由 %@ 在 %@ %@ 时创建";

/**/
"Edited by %@ %d minutes ago" = "在 %d 分钟前由 %@ 编辑";

/**/
"Edited by %@ an hour ago" = "一小时前由 %@ 编辑";

/**/
"Edited by %@ %d hours ago" = "由 %@ 在 %d 小时前编辑";

/**/
"Edited by %@ on %@ at %@ - day" = "由 %@ 在 %@ %@ 时编辑";

/**/
"Edited by %@ on %@ at %@ - full" = "由 %@ 在 %@ %@ 时编辑";

/**/
"Created by %@" = "由 %@ 创建";

/**/
"Edited by %@" = "由 %@ 编辑";

/**/
"Created %d minutes ago" = "在 %d 分钟前创建";

/**/
"Created an hour ago" = "在一小时前创建";

/**/
"Created %d hours ago" = "在 %d 小时前创建";

/*"Created on ${weekDay} at ${formattedTime}"*/
"Created on %@ at %@ - day" = "在 %@ %@ 时创建";

/*"Created on ${formattedDate} at ${formattedTime}"*/
"Created on %@ at %@ - full" = "在 %@ %@ 时创建";

/**/
"Edited %d minutes ago" = "在 %d 分钟前编辑";

/**/
"Edited an hour ago" = "在一小时前编辑";

/**/
"Edited %d hours ago" = "在 %d 小时前编辑";

/*"Edited on ${weekDay} at ${formattedTime}"*/
"Edited on %@ at %@ - day" = "在 %@ %@ 时编辑";

/*"Edited on ${formattedDate} at ${formattedTime}"*/
"Edited on %@ at %@ - full" = "在 %@ %@ 时编辑";

/* Used to denote a required field */
"Required" = "必填";

/* Used for naming layers with no names */
"Layer %d" = "图层 %d";

/* Geocoding: returned when locator cannot find address for given location */
"Cannot find address for location" = "无法找到位置的地址";

/* Geocoding: returned when locator cannot find location for given address */
"Cannot find location for address" = "无法找到地址的位置";

/* Geocoding: core: used when address cannot be read */
"Cannot read address" = "无法读取地址";

/* Geocoding: core: used when one of the locator files cannot be found */
"File not found" = "未找到文件";

/* Geocoding: core: returned when locator cannot be loaded */
"Cannot load locator" = "无法加载定位器";

/* Geocoding: core: returned when some internal engine error occurs */
"Locator internal error" = "定位器内部错误";

/* Geocoding: core: used when client tried to geocode intersections while locator does not support it */
"Intersections geocoding is not supported by locator" = "定位器不支持交叉点地理编码";

/* Geocoding: core: returned when some locator property is not valid */
"Invalid locator properties" = "无效的定位器属性";

/* Geocoding: core: used when client did not set required field for address geocoding */
"Required field is missing" = "缺少必填字段";

/* Geocoding: core: used when operation is performed over uninitialized locator */
"Locator is not initialized" = "定位器未进行初始化";

/* Geocoding: core: returned when locator format is not supported */
"Unsupported locator format" = "不支持的定位器格式";

/* Geocoding: core: returned when geocoding engine cannot make projection transformation */
"Unsupported projection transformation" = "不支持的投影变换";

/* Geocoding: core: used when given spatial reference is not supported */
"Unsupported spatial reference" = "不支持的空间参考";

/* Network analyst errors */
"Cannot open network." = "无法打开网络。";
"Cannot retrieve route task parameters." = "无法检索路径任务参数。";
"Insufficient number of stops." = "停靠点数不足。";
"Stop (%@) was not located." = "未找到停靠点(%@)。";
"Stop (%@) is located on a non traversable element." = "停靠点(%@)位于不可穿越的元素上。";
"Stop (%@) is located on a soft restricted element." = "停靠点(%@)位于软限制的元素上。";
"Point barrer (%@) was not located." = "未找到点障碍(%@)。";
"Point barrier (%@) has invalid added cost attribute name." = "点障碍(%@)具有无效的增加成本型属性名称。";
"Line barrier (%@) has invalid scaled cost attribute name." = "线障碍(%@)具有无效的调整成本型属性名称。";
"Line barrier (%@) does not cover any network elements." = "线障碍(%@)未涵盖任何网络元素。";
"Polygon barrier (%@) has invalid scaled cost attribute name." = "面障碍(%@)具有无效的调整成本型属性名称。";
"Polygon barrier (%@) does not cover any network elements." = "面障碍(%@)未涵盖任何网络元素。";
"'%@' is an invalid impedance attribute." = "'%@' 是无效的阻抗属性。";
"'%@' restriction attribute is invalid." = "'%@' 约束属性无效。";
"'%@' accumulate attribute is invalid." = "'%@' 累积属性无效。";
"'%@' is an invalid directions time attribute." = "'%@' 是无效的方向时间属性。";
"Directions distance attribute is invalid." = "方向距离属性无效。";
"Invalid attribute parameter attribute name (%@)." = "无效的属性参数属性名称(%@)。";
"Invalid attribute parameter parameter name (%@)." = "无效的属性参数参数名称(%@)。";
"Invalid value type for attribute (%1$@) parameter (%2$@)." = "属性(%1$@)参数(%2$@)的值类型无效。";
"Invalid restriction usage value for attribute (%1$@) parameter (%2$@)." = "属性(%1$@)参数(%2$@)的约束条件用法值无效。";
"Neutral restriction usage value for attribute (%1$@) parameter (%2$@)." = "属性(%1$@)参数(%2$@)的约束条件用法值不确定。";
"Soft restricted element (%@) was traversed." = "软限制元素(%@)已被穿越。";
"The network does not have a hierarchy attribute for performing hierarchical route planning." = "网络没有用于执行等级路径规划的等级属性。";
"No path can be found between a given pair of stops (%@)." = "无法在给定的一对停靠点(%@)之间找到任何路径。";
"The input spatial reference is undefined." = "输入空间参考未定义。";
"The output spatial reference is undefined." = "输出空间参考未定义。";
"The directions style is invalid." = "方向样式无效。";
"The directions language is invalid." = "方向语言无效。";
"Directions time and distance attributes do not match." = "方向时间和距离属性不匹配。";
"The directions road class attribute is invalid." = "方向道路类属性无效。";
"Unknown condition." = "未知条件。";
"Invalid route task parameters." = "无效的路径任务参数。";
"Route task's solution cannot be found." = "无法找到路径任务的解决方案。";
"Route task was cancelled." = "路径任务已取消。";
"Route task internal error." = "路径任务内部错误。";
"Route name property is not supported for local route task." = "本地路径任务不支持路径名称属性。";
"Local route task parameters should be retrieved from route task." = "应从路径任务中检索本地路径任务参数。";
"Cannot retrieve network description." = "无法检索网络描述。";
"Only one length attribute can be specified for impedanceAttributeName and accumulateAttributeNames." = "只能为 impedanceAttributeName 和 accumulateAttributeNames 指定一个长度属性。";
"Only one time attribute can be specified for impedanceAttributeName and accumulateAttributeNames." = "只能为 impedanceAttributeName 和 accumulateAttributeNames 指定一个时间属性。";
"Service not supported." = "服务不受支持。";

/* Unit Abbreviated strings */
"cm" = "cm";
"dd" = "dd";
"dm" = "dm";
"ft" = "ft";
"in" = "in";
"km" = "km";
"m" = "m";
"mi" = "mi";
"mm" = "mm";
"nm" = "nm";
"pt" = "pt";
"Unknown" = "未知";
"yd" = "yd";

/* Unit Display Strings */
"Centimeters" = "厘米";
"Decimal Degrees" = "十进制度";
"Decimeters" = "分米";
"Feet" = "英尺";
"Inches" = "英寸";
"Kilometers" = "千米";
"Meters" = "米";
"Miles" = "英里";
"Millimeters" = "毫米";
"Nautical Miles" = "海里";
"Points" = "磅";
"Yards" = "码";

/* Area Units Abbreviated Strings */
"sq. in" = "sq. in";
"sq. ft" = "sq. ft";
"sq. yd" = "sq. yd";
"ac" = "ac";
"sq. mi" = "sq. mi";
"sq. mm" = "sq. mm";
"sq. cm" = "sq. cm";
"sq. dm" = "sq. dm";
"sq. m" = "sq. m";
"ares" = "are";
"ha" = "ha";
"sq. km" = "sq. km";

/* Area Units Display Strings */
"Square Inches" = "平方英寸";
"Square Feet" = "平方英尺";
"Square Yards" = "平方码";
"Acres" = "英亩";
"Square Miles" = "平方英里";
"Square Millimeters" = "平方毫米";
"Square Centimeters" = "平方厘米";
"Square Decimeters" = "平方分米";
"Square Meters" = "平方米";
"Ares" = "公亩";
"Hectares" = "公顷";
"Square Kilometers" = "平方千米";

/* Errors */
"Class not @protocol AGSCoding compliant" = "不符合 @protocol AGSCoding 的类";
"Authorization required" = "所需授权";
"Token is invalid or has expired" = "令牌无效或已过期";
"Unknown error occurred" = "发生未知错误";
"Empty username/password" = "用户名/密码为空";
"Token URL is nil. You must set a valid token URL on the credential." = "令牌 URL 为 nil。您必须在凭据上设置有效令牌 URL。";
"Unknown authentication error" = "未知的验证错误";
"Error extracting identity" = "提取身份时出错";
"Error adding identity to the keychain" = "将身份添加到钥匙串时出错";
"Invalid Credentials" = "无效凭据";
"Bad URL." = "错误 URL。";
"The feature layer does not expose an object-id field." = "要素图层不显示 object-id 字段。";
"Both geodatabase and syncParams are required for this method." = "此方法同时需要地理数据库和 syncParams。";
"Uploading deltas is not supported with this replica." = "此复本不支持上传增量。";
"Error creating delta geodatabase" = "创建增量地理数据库时出错";
"Unable to create result image layer" = "无法创建结果影像图层";
"Cache at path '%@' not found." = "没有找到路径 '%@' 的缓存。";
"To add an item, you must be logged in to the portal." = "要添加项目，您必须登录到门户。";
"To add an item, you must specify a value in the AGSPortalItemContentParameters." = "要添加项目，您必须在 AGSPortalItemContentParameters 中指定一个值。";
"The portal failed to add the item." = "门户添加项目失败。";
"To delete an item, you must be logged in to the portal." = "要删除项目，您必须登录到门户。";
"The portal failed to delete the item." = "门户删除项目失败。";
"To update an item, an itemId and logged in user are required." = "要更新项目，需要 itemId 并进行用户登录。";
"The item failed to update." = "项目更新失败。";
"The item failed to update JSON." = "项目更新 JSON 失败。";
"You must be logged in to a portal to add a comment." = "您必须登录到门户来添加评论。";
"The comment failed to be added." = "添加评论失败。";
"You must be logged in to a portal to fetch the current user's rating." = "您必须登录到门户来获取当前用户评级。";
"You must be logged in to a portal to add a rating." = "您必须登录到门户来添加评级。";
"The rating failed to be added." = "添加评级失败。";
"To share an item, you must be logged in to the portal." = "要共享项目，您必须登录到门户。";
"To unshare an item, you must be logged in to the portal and specify groups with which to unshare the item." = "要取消共享项目，您必须登录到门户并指定要取消与其共享项目的组。";
"Bad Request" = "错误请求";
"Credential Required" = "所需 AGSCredential";
"Job not created" = "未创建作业";
"Service did not return a valid URL" = "服务没有返回有效 URL";
"Service did not return a file" = "服务没有返回文件";
"Service did not return a size" = "服务没有返回大小";
"Job failed" = "作业失败";
"Job timed out" = "作业超时";
"Job was cancelled" = "作业已取消";
"Job was deleted" = "作业已删除";

/* OAuth */
"The specified clientID is invalid" = "指定的客户端标识无效";











